In [48]:
import pandas as pd
import numpy as np

In [49]:
sozlukVerisi={"İstanbul":[26,24,np.nan],"Ankara":[15,np.nan,22],"Sakarya":[25,23,24]}

In [50]:
havaDurumaDataFrame=pd.DataFrame(sozlukVerisi)

In [51]:
havaDurumaDataFrame

   İstanbul  Ankara  Sakarya
0      26.0    15.0       25
1      24.0     NaN       23
2       NaN    22.0       24

# Veri olmayanları sil

In [52]:
havaDurumaDataFrame.dropna()

   İstanbul  Ankara  Sakarya
0      26.0    15.0       25

In [53]:
havaDurumaDataFrame.dropna(axis=1)

   Sakarya
0       25
1       23
2       24

# limit belirtme

In [54]:
yenikVerisi={"İstanbul":[26,24,np.nan],"Ankara":[15,np.nan,22],"Sakarya":[25,23,24],"Kocaeli":[24,np.nan,np.nan]}

In [55]:
yeniDataFrame=pd.DataFrame(yenikVerisi)

In [56]:
yeniDataFrame

   İstanbul  Ankara  Sakarya  Kocaeli
0      26.0    15.0       25     24.0
1      24.0     NaN       23      NaN
2       NaN    22.0       24      NaN

In [57]:
yeniDataFrame.dropna(axis=1,thresh=2)

   İstanbul  Ankara  Sakarya
0      26.0    15.0       25
1      24.0     NaN       23
2       NaN    22.0       24

# boş olanları doldurma

In [58]:
doldurulmusDataFrame=yeniDataFrame.fillna(0)

In [59]:
doldurulmusDataFrame

   İstanbul  Ankara  Sakarya  Kocaeli
0      26.0    15.0       25     24.0
1      24.0     0.0       23      0.0
2       0.0    22.0       24      0.0

# grouplama (groupby)

In [60]:
maasSozlugu={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Çalışanlar":["ali","veli","hasan","hüseyin","can","sare"],
             "Maaş":[60000,61000,59000,59500,58000,58500]
             }

In [61]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [62]:
maasDataFrame

   Departman Çalışanlar   Maaş
0    Yazılım        ali  60000
1    Yazılım       veli  61000
2  Pazarlama      hasan  59000
3  Pazarlama    hüseyin  59500
4      Hukuk        can  58000
5      Hukuk       sare  58500

In [63]:
groupObjesi=maasDataFrame.groupby("Departman")

In [64]:
groupObjesi.count()

           Çalışanlar  Maaş
Departman
Hukuk               2     2
Pazarlama           2     2
Yazılım             2     2

In [65]:
groupObjesi.mean() #ortalama maaş verdi

              Maaş
Departman
Hukuk      58250.0
Pazarlama  59250.0
Yazılım    60500.0

In [66]:
groupObjesi.min()

          Çalışanlar   Maaş
Departman
Hukuk            can  58000
Pazarlama      hasan  59000
Yazılım          ali  60000

In [67]:
groupObjesi.max()

          Çalışanlar   Maaş
Departman
Hukuk           sare  58500
Pazarlama    hüseyin  59500
Yazılım         veli  61000

In [68]:
groupObjesi.describe() # hepsini gösterecek

           Maaş                                                           \
          count     mean         std      min      25%      50%      75%
Departman
Hukuk       2.0  58250.0  353.553391  58000.0  58125.0  58250.0  58375.0
Pazarlama   2.0  59250.0  353.553391  59000.0  59125.0  59250.0  59375.0
Yazılım     2.0  60500.0  707.106781  60000.0  60250.0  60500.0  60750.0


               max
Departman
Hukuk      58500.0
Pazarlama  59500.0
Yazılım    61000.0

# birleştirme ( concatenation )

In [69]:
sozluk1={"isim":["ali","veli","hasan","hüseyin"],"spor":["koşu","yüzme","bisiklet",np.nan],"kalori":[50,100,75,0]}
sozluk2={"isim":["ayşe","fatma","hayriye","ümmiye"],"spor":["yüzme","bisiklet",np.nan,"koşu"],"kalori":[100,75,0,50]}
sozluk3={"isim":["sen","ben","siz","biz"],"spor":["git","gel","dur","koş"],"kalori":[50,100,75,0]}

In [70]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [71]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

       isim      spor  kalori
0       ali      koşu      50
1      veli     yüzme     100
2     hasan  bisiklet      75
3   hüseyin       NaN       0
4      ayşe     yüzme     100
5     fatma  bisiklet      75
6   hayriye       NaN       0
7    ümmiye      koşu      50
8       sen       git      50
9       ben       gel     100
10      siz       dur      75
11      biz       koş       0

# kaynaştırma (merge) nedense sıkıntı var kodlar doğru ders 6.11

In [72]:
mergeSozluk1={"Isim":["ahmet","mehmet","zeynep","atıl"],
             "kalori":[100,200,150,250]
             }

In [73]:
mergeSozluk1={"Isim":["ahmet","mehmet","zeynep","atıl"],
             "spor":["aa","dd","ss","ff"]
             }

In [74]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [75]:
mergeDataFrame2=pd.DataFrame(mergeSozluk1)

In [76]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim spor_x spor_y
0   ahmet     aa     aa
1  mehmet     dd     dd
2  zeynep     ss     ss
3    atıl     ff     ff

In [77]:
# ornek

In [78]:
maasSozlu={"isim":["ali","veli","hasan","hüseyin"],
          "departman":["yazılım","satış","pazarlama","yazılım"],
           "maas":[900,700,600,800]
          }

In [79]:
maasDataFrame=pd.DataFrame(maasSozlu)

In [80]:
maasDataFrame

      isim  departman  maas
0      ali    yazılım   900
1     veli      satış   700
2    hasan  pazarlama   600
3  hüseyin    yazılım   800

In [81]:
maasDataFrame["departman"]

0      yazılım
1        satış
2    pazarlama
3      yazılım
Name: departman, dtype: object

In [82]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [83]:
maasDataFrame["departman"].nunique()

3

In [84]:
maasDataFrame["departman"].value_counts()

yazılım      2
satış        1
pazarlama    1
Name: departman, dtype: int64

In [85]:
def BurutenNete(maas):
    return maas*0.66

In [86]:
maasDataFrame["maas"].apply(BurutenNete)

0    594.0
1    462.0
2    396.0
3    528.0
Name: maas, dtype: float64

In [93]:
yeniVeri={"karakter":["aliler","aliler","veliler","veliler","veliler"],
         "karakter ismi":["a","b","c","d","d"],
          "yas":[10,20,30,40,50]
         }

In [94]:
karakterDF=pd.DataFrame(yeniVeri)

In [95]:
karakterDF

  karakter karakter ismi  yas
0   aliler             a   10
1   aliler             b   20
2  veliler             c   30
3  veliler             d   40
4  veliler             d   50

In [98]:
karakterDF.pivot_table(values="yas" , index=["karakter","karakter ismi"],aggfunc=np.sum) # aggfunc=np.sum olmazsa aynı olanların ortalamasını veriyor .

                        yas
karakter karakter ismi
aliler   a               10
         b               20
veliler  c               30
         d               90